app/controllers/backend/estoques_controller.rb

  def edit
    @estoque = Estoque.find(params[:id])
---
SELECT * FROM "estoques" WHERE ("estoques"."id" = 1)

  def update
    @estoque = Estoque.find(params[:id])

    if @estoque.update_attributes(params[:estoque])
---
SELECT * FROM "estoques" WHERE ("estoques"."id" = 2)
UPDATE "estoques" SET "quantidade" = 30, "updated_at" = '2010-03-25 20:13:18' WHERE "id" = 2

  def destroy
    if Estoque.find(params[:id]).destroy
---
DELETE FROM "estoques" WHERE "id" = 2
SELECT * FROM "estoques" WHERE ("estoques"."id" = 2)