app/controllers/backend/farmacos_controller.rb

  def create
    @farmaco = Farmaco.new(params[:farmaco])
    if @farmaco.save
---
INSERT INTO "farmacos" ("apresentacao_id", "forma_id", "farmaco", "created_at", "updated_at", "posologia", "informacoes_tecnicas", "controlado", "padronizado") VALUES(NULL, 2, 'SUFENTANILA 50mcg/ml', '2010-04-06 00:28:12', '2010-04-06 00:28:12', NULL, NULL, 't', 'f')

  def edit
    @farmaco = Farmaco.find(params[:id])
---
SELECT * FROM "farmacos" WHERE ("farmacos"."id" = 1)

  def update
    @farmaco = Farmaco.find(params[:id])

    if @farmaco.update_attributes(params[:farmaco])
---
SELECT * FROM "farmacos" WHERE ("farmacos"."id" = 1)
UPDATE "farmacos" SET "farmaco" = 'Diazepan 10mg', "updated_at" = '2010-03-23 22:04:20' WHERE "id" = 1

  def destroy
    if Farmaco.find(params[:id]).delete
---
DELETE FROM "farmacos" WHERE ("id" IN (252))
SELECT * FROM "farmacos" WHERE (farmaco LIKE '%Lítio%') LIMIT 1