app/controllers/backend/formas_controller.rb

  def create
    @forma = Forma.new(params[:forma])
    if @forma.save
---
INSERT INTO "formas" ("texto", "sigla", "created_at", "updated_at") VALUES('Comprimido', 'COMP', '2010-03-23 22:07:51', '2010-03-23 22:07:51')

  def edit
    @forma = Forma.find(params[:id])
---
SELECT * FROM "formas" WHERE ("formas"."id" = 2)

  def update
    @forma = Forma.find(params[:id])

    if @forma.update_attributes(params[:forma])
---
SELECT * FROM "formas" WHERE ("formas"."id" = 3)
UPDATE "formas" SET "texto" = 'Comprimido1', "sigla" = 'COMP', "updated_at" = '2010-03-26 14:35:44' WHERE "id" = 1