app/controllers/backend/locals_controller.rb

  def create
    @local = Local.new(params[:local])
    if @local.save
---
INSERT INTO "locals" ("nome", "empresa", "sigla", "created_at", "updated_at") VALUES('Farmácia Hospitalar', 'Hospital Oswaldo Cruz - HOC', 'FH', '2010-03-25 18:56:53', '2010-03-25 18:56:53')

  def edit
    @local = Local.find(params[:id])
---
SELECT * FROM "locals" WHERE ("locals"."id" = 1)

  def update
    @local = Local.find(params[:id])

    if @local.update_attributes(params[:local])
---
SELECT * FROM "locals" WHERE ("locals"."id" = 1)
UPDATE "locals" SET "empresa" = 'Hospital Oswaldo Cruz', "updated_at" = '2010-03-25 17:55:36' WHERE "id" = 1