app/controllers/backend/movimentacaos_controller.rb

INSERT INTO "movimentacaos" ("estoque_id", "tipo_movimentacao_id", "quantidade", "observacao", "created_at", "updated_at", "farmaco_id") VALUES(NULL, 1, 30, '', '2010-04-07 14:23:54', '2010-04-07 14:23:54', 257)
SELECT * FROM "tipo_movimentacaos"
---
  def create
    @movimentacao = @estoque.movimentacaos.new(params[:movimentacao])
    if @movimentacao.save
      respond_to do |format|
        format.html { redirect_parent_to(:action => "edit", :id => @movimentacao) }
        format.json { render :json => { :success => true } }
      end
    else
      respond_to do |format|
        format.html { render_to_parent(:action => "edit") }
        format.json { render :json => { :success => false, :msg => @movimentacao.errors.full_messages.join("<br />") } }

SELECT * FROM "movimentacaos" WHERE ("movimentacaos"."id" = 1)
---
  def edit
    @movimentacao = Movimentacao.find(params[:id])

SELECT * FROM "tipo_movimentacaos" WHERE ("tipo_movimentacaos"."id" = 5)
UPDATE "movimentacaos" SET "tipo_movimentacao_id" = 5, "updated_at" = '2010-04-06 01:24:22' WHERE "id" = 22
---
  def update
    @movimentacao = Movimentacao.find(params[:id])

    if @movimentacao.update_attributes(params[:movimentacao])

DELETE FROM "movimentacaos" WHERE "id" = 27
SELECT * FROM "tipo_movimentacaos" WHERE ("tipo_movimentacaos"."id" = 5)
---
  def destroy
    if @estoque.movimentacaos.find(params[:id]).destroy