app/controllers/backend/tipo_movimentacaos_controller.rb

INSERT INTO "tipo_movimentacaos" ("nome", "origem_id", "destino_id", "quantidade", "created_at", "updated_at") VALUES('Compra de Medicamentos - CAF', NULL, 2, NULL, '2010-03-29 12:51:15', '2010-03-29 12:51:15')
---
  def create #OPTIMIZE
    @tipo_movimentacao = TipoMovimentacao.new(params[:tipo_movimentacao])
    if @tipo_movimentacao.save

SELECT * FROM "tipo_movimentacaos" WHERE ("tipo_movimentacaos"."id" = 1)
---
  def edit
    @tipo_movimentacao = TipoMovimentacao.find(params[:id])

SELECT * FROM "tipo_movimentacaos" WHERE ("tipo_movimentacaos"."id" = 1)
UPDATE "tipo_movimentacaos" SET "nome" = 'Distribuição de Medicamentos - CAF => FH', "origem_id" = 2, "destino_id" = 1, "updated_at" = '2010-03-29 12:52:25' WHERE "id" = 1
---
  def update
    @tipo_movimentacao = TipoMovimentacao.find(params[:id])

    if @tipo_movimentacao.update_attributes(params[:tipo_movimentacao])

DELETE FROM "tipo_movimentacaos" WHERE "id" = 4
SELECT * FROM "tipo_movimentacaos" WHERE ("tipo_movimentacaos"."id" = 4)
---
  def destroy
    if TipoMovimentacao.find(params[:id]).destroy